<template>
  <v-content>
    <v-container grid-list-md>
      <v-row>
        <v-col cols="12">
          <v-card about class="d-block" elevation="0" color="rgb(255,255,255,0.8)">
            <v-card-title>About</v-card-title>
            <v-list
              color="rgb(255,255,255,0.8)"
              class="pa-4 grey--text text--darken-2"
            >
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
            </v-list>
          </v-card>
        </v-col>
        <v-col cols="12">
          <v-divider />
          <v-card skill elevation="0" color="rgb(255,255,255,0.8)">
            <v-card-title>Skill</v-card-title>
            <v-list color="rgb(255,255,255,0.8)">
              <v-list-item v-for="(item, i) in items" :key="i">
                <v-list-item-icon>
                  <v-icon v-text="item.icon" />
                </v-list-item-icon>
                <v-list-item-title v-text="item.text" />
              </v-list-item>
            </v-list>
          </v-card>
        </v-col>
        <v-col cols="12">
          <v-divider />
          <v-card activity elevation="0" color="rgb(255,255,255,0.8)">
            <v-card-title>Activity</v-card-title>
            <v-list
              color="rgb(255,255,255,0.8)"
              class="pa-4 grey--text text--darken-2"
            >
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。


              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。

              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。

              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
              出於對電機資訊相關的熱情，於⾼中便開始參與資訊社以接觸相關領域。在進入⼤學後更是積極突破，除了在課業上的努⼒，更是多⽅參與活動，再精進⾃我技能的同時，也開拓我的視野。
            </v-list>
          </v-card>
        </v-col>
      </v-row>
    </v-container>
  </v-content>
</template>

<script>
export default {
  data() {
    return {
      items: [
        { text: 'C', icon: 'mdi-alpha-c' },
        { text: 'Verilog', icon: 'mdi-alpha-v' },
        { text: 'CSS', icon: 'mdi-language-css3' },
        { text: 'Javascript', icon: 'mdi-language-javascript' },
        { text: 'Vue', icon: 'mdi-vuejs' }
      ]
    };
  }

};
</script>

<style scoped>

</style>
